app/controllers/clientes_controller.rb

  def index
    @clientes = Cliente.all
---
SELECT "clientes".* FROM "clientes"

  def show
    @cliente = Cliente.find(params[:id])
---
SELECT  "clientes".* FROM "clientes" WHERE "clientes"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]

  def edit
    @cliente = Cliente.find(params[:id])
---
SELECT  "clientes".* FROM "clientes" WHERE "clientes"."id" = $1 LIMIT $2  [["id", 2], ["LIMIT", 1]]

  def create
    @cliente = Cliente.new(cliente_params)

    if @cliente.save
---
INSERT INTO "clientes" ("Nome", "CPF", "Email", "Endereco", "Data_de_Nascimento", "Status", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7, $8) RETURNING "id"

  def update
    @cliente = Cliente.find(params[:id])

    if @cliente.update(cliente_params)
---
SELECT  "clientes".* FROM "clientes" WHERE "clientes"."id" = $1 LIMIT $2  [["id", 19], ["LIMIT", 1]]
UPDATE "clientes" SET "Endereco" = $1, "Data_de_Nascimento" = $2, "Status" = $3, "updated_at" = $4 WHERE "clientes"."id" = $5  [["Endereco", "Quadra 999 Conjunto 99 Casa 99"], ["Data_de_Nascimento", "33/33/3333"], ["Status", "Cancelado"], ["updated_at", "2018-07-08 17:27:11.020231"], ["id", 75]]

  def destroy
    @cliente = Cliente.find(params[:id])
    @cliente.destroy
---
SELECT  "clientes".* FROM "clientes" WHERE "clientes"."id" = $1 LIMIT $2  [["id", 2], ["LIMIT", 1]]
DELETE FROM "clientes" WHERE "clientes"."id" = $1  [["id", 2]]