app/controllers/pacotes_controller.rb

SELECT  "clientes".* FROM "clientes" WHERE "clientes"."id" = $1 LIMIT $2  [["id", 119], ["LIMIT", 1]]
INSERT INTO "pacotes" ("Pagamento", "Plano", "cliente_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["Pagamento", "4.788.923.894.329,04"], ["Plano", "fanático pelo time"], ["cliente_id", 119], ["created_at", "2018-07-09 03:08:53.067173"], ["updated_at", "2018-07-09 03:08:53.067173"]]
---
  def create
    @cliente = Cliente.find(params[:cliente_id])
    @pacote = @cliente.pacotes.create(pacote_params)

SELECT  "clientes".* FROM "clientes" WHERE "clientes"."id" = $1 LIMIT $2  [["id", 19], ["LIMIT", 1]]
SELECT  "pacotes".* FROM "pacotes" WHERE "pacotes"."cliente_id" = $1 AND "pacotes"."id" = $2 LIMIT $3  [["cliente_id", 119], ["id", 64], ["LIMIT", 1]]
SELECT  "clientes".* FROM "clientes" WHERE "clientes"."id" = $1 LIMIT $2  [["id", 119], ["LIMIT", 1]]
DELETE FROM "pacotes" WHERE "pacotes"."id" = $1  [["id", 64]]
---
  def destroy
    @cliente = Cliente.find(params[:cliente_id])
    @pacote = @cliente.pacotes.find(params[:id])
    @pacote.destroy