app/views/pacotes/_pacote.html.erb

<% @cliente.pacotes.each do |pacote| %>
---
SELECT "pacotes".* FROM "pacotes" WHERE "pacotes"."cliente_id" = $1  [["cliente_id", 19]]